{"pageProps":{"content":"<h1 class=\"text-5xl text-primary text-center font-bold mb-6 !leading-tight\">Pourquoi du contenu francophone ?</h1><div class=\"text-center text-sm mb-4\">Le 27 décembre 2021</div><p class=\"mb-4\">Ce site est exclusivement rédigé en français, à l&#39;exception de certains termes qui seront expliqués via le glossaire ainsi que le code quand j&#39;en fournirai.</p><p class=\"mb-4\">Dans un domaine où l&#39;anglais est omniprésent, j&#39;ai fait le choix de me contenter du français et ce pour plusieurs raisons.</p>\n      <h3 class=\"text-xl text-primary mb-2\">\n        Tous les dévs francophones ne sont pas à l&#39;aise en anglais\n      </h3><p class=\"mb-4\">Pour des gens comme moi qui n&#39;ont pas de difficultés particulières en langues, ça peut paraître incompréhensible. Dans les faits, j&#39;ai croisé de nombreuses personnes avec des lacunes, fortement rebutées par du contenu anglais.</p>\n      <h3 class=\"text-xl text-primary mb-2\">\n        C&#39;est mieux adapté aux débutants\n      </h3><p class=\"mb-4\">Ca rejoint le point précédent ; découvrir la programmation passe par tout un jargon à assimiler, parfois difficile à comprendre dans une autre langue que sa langue maternelle.</p>\n      <h3 class=\"text-xl text-primary mb-2\">\n        La diversification\n      </h3><p class=\"mb-4\">Il en faut pour tous les goûts ! On n&#39;écrit pas tous de la même manière, vous prendrez probablement plus plaisir à lire d&#39;autres personnes que moi sur tel ou tel sujet et vice-versa, francophone comme anglophone.</p>\n      <h3 class=\"text-xl text-primary mb-2\">\n        Ma langue maternelle\n      </h3><p class=\"mb-4\">Je suis français, les tournures de phrases me viennent donc plus naturellement en français qu&#39;en anglais. L&#39;humour aussi... ça, vous le verrez bien assez tôt.</p><hr class=\"!my-6 m-auto text-primary max-w-screen-md\"/><p class=\"mb-4\">En conclusion, bien que ce site soit uniquement rédigé en français, je ne saurais que trop vous encourager à améliorer vos compétences en anglais en lisant du contenu anglophone. </p><p class=\"mb-4\">La raison à cela est que vous aurez du mal à trouver toutes les réponses à vos questions si vous les posez uniquement en français et que vous devrez irrémédiablement passer par la case traduction (que ce soit dans votre tête ou par un logiciel), <strong>plusieurs fois par jours</strong>. N&#39;ayez pas honte, on passe tous énormément de temps à sillonner le web pour trouver une solution ou une piste pour corriger un obscur bug.</p><p class=\"mb-4\">Dernier conseil : écrivez votre code en anglais (bon, <a class=\"text-primary underline underline-offset-1\" target=\"_blank\" rel=\"noreferrer noopener nofollow\" href=\"https://pcsoft.fr/wlangage.htm\">sauf si la syntaxe est en français</a> 😏), même sur des projets personnels : ça vous entraîne, ça vous fait réfléchir et vous permet de vous améliorer. En cas de doute sur un mot, utilisez un dictionnaire en ligne genre <a class=\"text-primary underline underline-offset-1\" target=\"_blank\" rel=\"noreferrer noopener nofollow\" href=\"https://www.wordreference.com/\">WordReference.com</a>.</p>"},"__N_SSG":true}